---
type: StructuralSectionSigmaProfileWithLips
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 5
tags: [revit-api, class]
---

# StructuralSectionSigmaProfileWithLips

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionSigmaProfileWithLips` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionSigmaProfileWithLips | 2016 | `public StructuralSectionSigmaProfileWithLips ( double width , double height , double wallNominalThickness , double wallDesignThickness , double innerFillet , double centroidHorizontal , double centroidVertical , double p` |
| Property | BendWidth | 2016 | `public double BendWidth { get ; set ; }` |
| Property | LipLength | 2016 | `public double LipLength { get ; set ; }` |
| Property | MiddleBendLength | 2016 | `public double MiddleBendLength { get ; set ; }` |
| Property | TopBendLength | 2016 | `public double TopBendLength { get ; set ; }` |